# Задача с канала: egoroff_channel
#10.4 Функция filter


# Вам дан список numbers, в нем есть и отрицательные числа и нули и положительные значения.
# Гарантируется, что список целиком состоит только из чисел.
#
# Необходимо при помощи функций filter и len определить в этом списке количество
#
# 1 - отрицательных значений
# 2 - нулевых значений
# 3 - положительных
# Вывести найденные значения в том же порядке в одну строку через пробел.


numbers = [54, 71, 65, 51, 36, -82, -32, 61, -61, 92, 17, -68, -62, 40, 16, -49, -51, -38, 60, -24,
           -61, 3, -26, -46, -97, -28, 36, 7, 52, 56, -96, -69, 67, 76, 16, 36, 38, 74, 11, -87, 69,
           69, -69, -61, 92, 67, -45, -26, 94, 38, 27, -26, 10, 55, 28, -81, 53, -75, -32, -83, 38,
           83, -40, -51, 88, 28, 76, 25, 84, -79, -69, -65, 6, 12, 81, -58, -92, 44, -41, 60, -14, -65,
           7, 64, -40, -25, -91, -23, -19, -40, -4, 36, 38, 28, -27, -28, 72, 47, -95, 47, 10, 31, 62,
           -75, 22, -34, 44, -62, -30, -41, 19, -13, 30, -11, -54, -46, -80, -57, -60, 72, -49, 84, 5, 66,
           62, -35, 69, 23, 41, -15, 75, -53, 94, -76, -28, -41, -17, 71, 67, -50, 18, 65, -16, -27, -88]

ans_1 = len(list(filter(lambda x: x<0, numbers)))
ans_2 = len(list(filter(lambda x: x == 0, numbers)))
ans_3 = len(list(filter(lambda x: x>0, numbers)))

print(ans_1, ans_2, ans_3)



